# 1. Список студентов с именем, фимилией и вознастром
# 2. Вывести на экран
# 3. Посчитать количество студентов, у которых в сумме имя и фамилия больше 15 символов
# 4. Вывести на экран всех девушек (имя) в обратном порядке алфавита
# 5. Записать студентов в файл в этом порядке
# *6. В конце файла добавить сумму всех гласных букв этого списка

# 1
names = [
    ["Быкова", "Анна", 35],
    ["Лещенко", "Валентина", 29],
    ["Руденко", "Анна", 23],
    ["Шопина", "Ольга", 26],
    ["Белик", "Анна", 19],
    ["Дубровская", "Татьяна", 20],
    ["Иовчева", "Анастасия", 35],
    ["Кравченко", "Елена", 27],
    ["Лисова", "Александра", 34],
    ["Михайлова", "Дарья", 18],
    ["Пискарева", "Вероника", 23],
    ["Рудик", "Наталья", 33],
    ["Узор", "Михаил", 23],
    ["Фомичева", "Дарья", 35],
    ["Шмелев", "Леонид", 31],
    ["Безбердая", "Лилия", 22],
    ["Волобаев", "Артем", 18],
    ["Капустина", "Ирина", 23],
    ["Козачук", "Мария", 26],
    ["Мальцева", "Полина", 25],
    ["Папкина", "Алена", 20],
    ["Билык", "Мария", 20],
    ["Гаджикеримова", "Анжела", 24],
    ["Енчилик", "Полина", 32],
    ["Кислякова", "Наталья", 30],
    ["Лобанов", "Алексей", 31],
    ["Рыжов", "Александр", 27],
    ["Сорокина", "Ксения", 33],
    ["Шестова", "Елизавета", 18],
    ["Гаврилова", "Валентина", 22],
    ["Дорошенко", "Сергей", 22],
    ["Киселева", "Анна", 34],
    ["Костин", "Александр", 22],
    ["Михайлова", "Мария", 18],
    ["Полякова", "Ксения", 24],
    ["Михайлова", "Виктория", 21],
    ["Дергачева", "Алена", 34],
    ["Никитина", "Ольга", 23],
    ["Двуреченская", "Елена", 35],
    ["Кошовский", "Тимур", 35],
    ["Шинкарева", "Галина", 21],
]

# 2.
print('{:<7} {:<15}  {:<15}  {:<10}'.format("Номер:", "Фамилия:", "Имя:", "Возраст:"))
for num, (surname, name, age) in enumerate(names):
    print('{:<7} {:<15}  {:<15}  {:<10}'.format(num, surname, name, age))

# 3.

length = 15
students_with_long_name = 0
for surname, name, age in names:
    if len(surname) + len(name) > length:
        students_with_long_name += 1

print("\nКоличество студентов с именем и фамилией длиннее {} символов - {}".format(length, students_with_long_name))
