# 2. Дан маршрут одного из поездов на текущий месяц.
# 
# 2.1. Создать объект этого маршрута. Выберите любой стандартный тип данных (список, словарь...)
# или набор типов данных.
# 
# 2.2. Написать функцию, выводящую такой объект маршрута в консоли (с помощью print). Возможно будет удобно
# разделить ее на несколько функций и создать для них отдельный модуль?
# 
# 2.3. Написать модуль с функциями расчета маршрута.
# * - добавить к разным участкам маршрута весовой коэффициент, то есть один участок поезд проезжает
# быстрее, другой медленнее.
# 
# - Общая длинна
# - Кол-во станций
# - Время маршрута (расчетное)
# 
# ( Сравнить 2 частка (пукт А-Д, пункт Д-З) )
# 
#   0 1 2 3 4 5 6 7 8 9
#   0 >-----+         +->
#   1   +-+ |         |
#   2   | | +-----+   |
#   3   | +-------+   |
#   4   |             |
#   5   |             |
#   6   +---------+   |
#   7             |   |
#   8             +---+
#   9

